memtier/performance/data/memorix/none-1.out
12        Threads
50        Connections per thread
100       Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.5 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets        26822.04          ---          ---         2.03413         1.87900         3.00700         3.43900        10.17500      1830.52 
Gets       268189.45        57.72    268131.73         2.03214         1.87900         2.99100         3.42300        10.11100      6783.68 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals     295011.49        57.72    268131.73         2.03232         1.87900         2.99100         3.42300        10.11100      8614.20 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.591        0.000
SET       1.743        5.000
SET       1.783       10.000
SET       1.807       15.000
SET       1.823       20.000
SET       1.831       25.000
SET       1.847       30.000
SET       1.855       35.000
SET       1.863       40.000
SET       1.871       45.000
SET       1.879       50.000
SET       1.887       52.500
SET       1.887       55.000
SET       1.895       57.500
SET       1.903       60.000
SET       1.903       62.500
SET       1.911       65.000
SET       1.919       67.500
SET       1.927       70.000
SET       1.935       72.500
SET       1.943       75.000
SET       1.951       76.250
SET       1.959       77.500
SET       1.967       78.750
SET       1.983       80.000
SET       1.999       81.250
SET       2.047       82.500
SET       2.575       83.750
SET       2.655       85.000
SET       2.703       86.250
SET       2.735       87.500
SET       2.751       88.125
SET       2.751       88.750
SET       2.767       89.375
SET       2.767       90.000
SET       2.783       90.625
SET       2.783       91.250
SET       2.799       91.875
SET       2.799       92.500
SET       2.815       93.125
SET       2.831       93.750
SET       2.831       94.062
SET       2.831       94.375
SET       2.831       94.688
SET       2.847       95.000
SET       2.847       95.312
SET       2.847       95.625
SET       2.863       95.938
SET       2.863       96.250
SET       2.879       96.562
SET       2.879       96.875
SET       2.879       97.031
SET       2.895       97.188
SET       2.895       97.344
SET       2.895       97.500
SET       2.911       97.656
SET       2.911       97.812
SET       2.911       97.969
SET       2.927       98.125
SET       2.927       98.281
SET       2.943       98.438
SET       2.943       98.516
SET       2.959       98.594
SET       2.959       98.672
SET       2.975       98.750
SET       2.975       98.828
SET       2.991       98.906
SET       3.007       98.984
SET       3.007       99.062
SET       3.039       99.141
SET       3.071       99.219
SET       3.087       99.258
SET       3.119       99.297
SET       3.183       99.336
SET       3.279       99.375
SET       3.359       99.414
SET       3.391       99.453
SET       3.423       99.492
SET       3.455       99.531
SET       3.503       99.570
SET       3.631       99.609
SET       3.791       99.629
SET       4.079       99.648
SET       4.447       99.668
SET       4.863       99.688
SET       5.279       99.707
SET       5.759       99.727
SET       6.207       99.746
SET       6.687       99.766
SET       7.199       99.785
SET       7.679       99.805
SET       7.903       99.814
SET       8.191       99.824
SET       8.447       99.834
SET       8.703       99.844
SET       8.959       99.854
SET       9.215       99.863
SET       9.471       99.873
SET       9.727       99.883
SET       9.983       99.893
SET      10.239       99.902
SET      10.367       99.907
SET      10.431       99.912
SET      10.559       99.917
SET      10.687       99.922
SET      10.815       99.927
SET      10.879       99.932
SET      11.007       99.937
SET      11.071       99.941
SET      11.135       99.946
SET      11.263       99.951
SET      11.263       99.954
SET      11.327       99.956
SET      11.391       99.958
SET      11.391       99.961
SET      11.455       99.963
SET      11.519       99.966
SET      11.519       99.968
SET      11.583       99.971
SET      11.647       99.973
SET      11.711       99.976
SET      11.711       99.977
SET      11.711       99.978
SET      11.775       99.979
SET      11.839       99.980
SET      11.839       99.982
SET      11.903       99.983
SET      11.903       99.984
SET      11.967       99.985
SET      11.967       99.987
SET      12.031       99.988
SET      12.095       99.988
SET      12.095       99.989
SET      12.159       99.990
SET      12.159       99.990
SET      12.223       99.991
SET      12.287       99.991
SET      12.351       99.992
SET      12.351       99.993
SET      12.479       99.993
SET      12.543       99.994
SET      12.607       99.994
SET      12.671       99.995
SET      12.735       99.995
SET      12.799       99.995
SET      12.799       99.995
SET      12.863       99.996
SET      12.863       99.996
SET      12.927       99.996
SET      13.055       99.997
SET      13.119       99.997
SET      13.119       99.997
SET      13.183       99.997
SET      13.247       99.997
SET      13.247       99.998
SET      13.311       99.998
SET      13.375       99.998
SET      13.439       99.998
SET      13.503       99.998
SET      13.567       99.998
SET      13.695       99.998
SET      13.759       99.999
SET      13.887       99.999
SET      13.951       99.999
SET      13.951       99.999
SET      14.015       99.999
SET      14.079       99.999
SET      14.207       99.999
SET      14.271       99.999
SET      14.399       99.999
SET      14.591       99.999
SET      14.591       99.999
SET      14.655       99.999
SET      14.783       99.999
SET      14.783       99.999
SET      14.911       99.999
SET      14.911       99.999
SET      14.911      100.000
SET      14.975      100.000
SET      14.975      100.000
SET      15.039      100.000
SET      15.295      100.000
SET      15.295      100.000
SET      15.487      100.000
SET      15.487      100.000
SET      15.743      100.000
SET      15.743      100.000
SET      16.767      100.000
SET      16.767      100.000
SET      16.895      100.000
SET      16.895      100.000
SET      17.023      100.000
SET      17.023      100.000
SET      17.023      100.000
[...]
SET      17.279      100.000
SET      17.279      100.000
SET      17.279      100.000
[...]
SET      17.407      100.000
SET      17.407      100.000
SET      17.407      100.000
[...]
SET      20.735      100.000
SET      20.735      100.000
SET      20.735      100.000
[...]
SET      25.343      100.000
SET      25.343      100.000
---
GET       0.399        0.000
GET       1.743        5.000
GET       1.783       10.000
GET       1.807       15.000
GET       1.823       20.000
GET       1.831       25.000
GET       1.847       30.000
GET       1.855       35.000
GET       1.863       40.000
GET       1.871       45.000
GET       1.879       50.000
GET       1.887       52.500
GET       1.887       55.000
GET       1.895       57.500
GET       1.895       60.000
GET       1.903       62.500
GET       1.911       65.000
GET       1.919       67.500
GET       1.927       70.000
GET       1.935       72.500
GET       1.943       75.000
GET       1.951       76.250
GET       1.959       77.500
GET       1.967       78.750
GET       1.983       80.000
GET       1.999       81.250
GET       2.039       82.500
GET       2.559       83.750
GET       2.639       85.000
GET       2.703       86.250
GET       2.735       87.500
GET       2.735       88.125
GET       2.751       88.750
GET       2.767       89.375
GET       2.767       90.000
GET       2.783       90.625
GET       2.783       91.250
GET       2.799       91.875
GET       2.799       92.500
GET       2.815       93.125
GET       2.815       93.750
GET       2.831       94.062
GET       2.831       94.375
GET       2.831       94.688
GET       2.847       95.000
GET       2.847       95.312
GET       2.847       95.625
GET       2.863       95.938
GET       2.863       96.250
GET       2.879       96.562
GET       2.879       96.875
GET       2.879       97.031
GET       2.895       97.188
GET       2.895       97.344
GET       2.895       97.500
GET       2.895       97.656
GET       2.911       97.812
GET       2.911       97.969
GET       2.927       98.125
GET       2.927       98.281
GET       2.943       98.438
GET       2.943       98.516
GET       2.959       98.594
GET       2.959       98.672
GET       2.959       98.750
GET       2.975       98.828
GET       2.991       98.906
GET       2.991       98.984
GET       3.007       99.062
GET       3.023       99.141
GET       3.055       99.219
GET       3.087       99.258
GET       3.119       99.297
GET       3.167       99.336
GET       3.247       99.375
GET       3.343       99.414
GET       3.391       99.453
GET       3.423       99.492
GET       3.455       99.531
GET       3.487       99.570
GET       3.583       99.609
GET       3.695       99.629
GET       3.951       99.648
GET       4.287       99.668
GET       4.735       99.688
GET       5.183       99.707
GET       5.631       99.727
GET       6.143       99.746
GET       6.623       99.766
GET       7.135       99.785
GET       7.647       99.805
GET       7.903       99.814
GET       8.159       99.824
GET       8.447       99.834
GET       8.703       99.844
GET       8.959       99.854
GET       9.215       99.863
GET       9.471       99.873
GET       9.727       99.883
GET       9.919       99.893
GET      10.175       99.902
GET      10.303       99.907
GET      10.431       99.912
GET      10.559       99.917
GET      10.687       99.922
GET      10.751       99.927
GET      10.879       99.932
GET      10.943       99.937
GET      11.071       99.941
GET      11.135       99.946
GET      11.263       99.951
GET      11.263       99.954
GET      11.327       99.956
GET      11.391       99.958
GET      11.391       99.961
GET      11.455       99.963
GET      11.455       99.966
GET      11.519       99.968
GET      11.583       99.971
GET      11.583       99.973
GET      11.647       99.976
GET      11.711       99.977
GET      11.711       99.978
GET      11.711       99.979
GET      11.775       99.980
GET      11.775       99.982
GET      11.839       99.983
GET      11.839       99.984
GET      11.903       99.985
GET      11.967       99.987
GET      11.967       99.988
GET      12.031       99.988
GET      12.031       99.989
GET      12.031       99.990
GET      12.095       99.990
GET      12.159       99.991
GET      12.159       99.991
GET      12.223       99.992
GET      12.287       99.993
GET      12.351       99.993
GET      12.415       99.994
GET      12.415       99.994
GET      12.479       99.995
GET      12.543       99.995
GET      12.607       99.995
GET      12.607       99.995
GET      12.671       99.996
GET      12.735       99.996
GET      12.799       99.996
GET      12.927       99.997
GET      12.991       99.997
GET      13.055       99.997
GET      13.119       99.997
GET      13.183       99.997
GET      13.183       99.998
GET      13.247       99.998
GET      13.311       99.998
GET      13.375       99.998
GET      13.503       99.998
GET      13.567       99.998
GET      13.695       99.998
GET      13.695       99.999
GET      13.759       99.999
GET      13.887       99.999
GET      13.951       99.999
GET      14.015       99.999
GET      14.143       99.999
GET      14.207       99.999
GET      14.271       99.999
GET      14.463       99.999
GET      14.591       99.999
GET      14.719       99.999
GET      14.847       99.999
GET      14.847       99.999
GET      14.911       99.999
GET      14.975       99.999
GET      15.103       99.999
GET      15.231      100.000
GET      15.359      100.000
GET      15.551      100.000
GET      15.807      100.000
GET      15.935      100.000
GET      16.063      100.000
GET      16.255      100.000
GET      16.511      100.000
GET      16.767      100.000
GET      17.023      100.000
GET      17.407      100.000
GET      17.663      100.000
GET      18.303      100.000
GET      18.943      100.000
GET      19.327      100.000
GET      19.583      100.000
GET      19.711      100.000
GET      19.967      100.000
GET      20.095      100.000
GET      20.351      100.000
GET      20.351      100.000
GET      20.479      100.000
GET      20.479      100.000
GET      20.991      100.000
GET      21.119      100.000
GET      21.631      100.000
GET      22.143      100.000
GET      22.271      100.000
GET      22.527      100.000
GET      23.039      100.000
GET      23.167      100.000
GET      23.167      100.000
GET      23.551      100.000
GET      23.935      100.000
GET      23.935      100.000
GET      24.191      100.000
GET      24.191      100.000
GET      24.191      100.000
[...]
GET      24.447      100.000
GET      24.447      100.000
GET      24.831      100.000
GET      24.831      100.000
GET      24.831      100.000
[...]
GET      24.959      100.000
GET      24.959      100.000
GET      24.959      100.000
GET      25.087      100.000
GET      25.087      100.000
GET      25.087      100.000
[...]
GET      25.471      100.000
GET      25.471      100.000
GET      25.471      100.000
[...]
GET      25.599      100.000
GET      25.599      100.000
---
WAIT      0.000      100.000